app/controllers/notices_controller.rb

SELECT * FROM `notices` WHERE (`notices`.user_id = 3) LIMIT 0, 10
---
  def index
    @notices = @user.notices.paginate(:page => params[:page], :per_page => 10)

SELECT * FROM `notices` WHERE (`notices`.`id` = 21 AND (`notices`.user_id = 1))
---
  def show
    @notice = @user.notices.find(params[:id])

SELECT * FROM `notices` WHERE (`notices`.`id` = 21 AND (`notices`.user_id = 1))
---
  def edit
    @notice = @user.notices.find(params[:id])

INSERT INTO `notices` (`content`, `public_token`, `created_at`, `title`, `user_id`, `updated_at`, `public`) VALUES('<div>Public note with alot of text<br><br><br>asf<br>gg<br>ag<br>d<br>svs<br>dh<br>sdb<br>dn<br>a<br>sd<br>b<br>ds<br>m<br><br>n<br><br></div>', NULL, '2020-07-27 18:50:01', 'Nafi', 1, '2020-07-27 18:50:01', 0)
---
  def create
    @notice = @user.notices.new(params[:notice])
    @notice.user_id = session[:user_id]
    respond_to do |format|
      if @notice.save

SELECT * FROM `notices` WHERE (`notices`.`id` = 21 AND (`notices`.user_id = 1))
UPDATE `notices` SET `public_token` = 'tgRHoUTU2sUXRzvw4d7ugA==', `content` = '<div>Public note with alot of text<br><br><br>asf<br>gg<br>ag<br>d<br>svs<br>dh<br>sdb<br>dnkjq,abf bjv,iakuj,fc ,dyewakj,gfc bz<br><br>a<br>sd<br>b<br>ds<br>m<br><br>n<br><br></div>', `updated_at` = '2020-07-27 19:26:04' WHERE `id` = 7
---
  def update
    @notice = @user.notices.find(params[:id])

    respond_to do |format|
      if @notice.update_attributes(params[:notice])

SELECT * FROM `notices` WHERE (`notices`.`id` = 4 AND (`notices`.user_id = 1))
DELETE FROM `notices` WHERE `id` = 4
---
  def destroy
    @notice = @user.notices.find(params[:id])
    @notice.destroy

SELECT * FROM `notices` WHERE (`notices`.user_id = 1 AND (public like 1)) LIMIT 1
---
  def my_public_notes
    @notices = @user.notices.all(:conditions => ["public like ?", true]).paginate(:page => params[:page], :per_page => 10)