app/controllers/passwords_controller.rb

SELECT * FROM `users` WHERE (`users`.`reset_password_token` = 'B6cpWSyJSmEaUiPDPnY9oQ==') LIMIT 1
---
  def edit
    @user = User.find_by_reset_password_token!(params[:id])

SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'ahammednafihbk@gmail.com' AND `users`.id <> 1) LIMIT 1
---
  def create
    user = User.find_by_email(params[:email])

SELECT * FROM `users` WHERE (`users`.`reset_password_token` = 'B6cpWSyJSmEaUiPDPnY9oQ==') LIMIT 1
UPDATE `users` SET `updated_at` = '2020-07-24 11:21:09', `password_digest` = '$2a$10$ZanizWdAgVJKuXi71ANXPezCBxYO0/5Hj.Zncmj/sjJvt0lt5Gux6' WHERE `id` = 1
---
  def update
    @user = User.find_by_reset_password_token!(params[:id])
    if @user.reset_password_sent_at < 2.hour.ago
      flash[:alert] = 'Password reset has expired'
      redirect_to new_password_path
    elsif @user.update_attributes(:password => params[:user][:password])