app/controllers/public_notes_controller.rb

SELECT * FROM `notices` WHERE (public like 1)
---
  def index
    @notices = Notice.public_notes.paginate(:page => params[:page], :per_page => 10)

SELECT * FROM `notices` WHERE (`notices`.`public_token` = 'a4m+qchbgodfh+arvgfmkw==') LIMIT 1
---
  def show
    @notice = Notice.find_by_public_token(params[:id])

SELECT * FROM `notices` WHERE (content like '%test%' and public like 1)
---
  def search
    if params[:content].present?
      @notices = Notice.public_search(params[:content]).paginate(:page => params[:page], :per_page => 10)