app/controllers/sessions_controller.rb

SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'ahammednafihbk@gmail.com' AND `users`.id <> 2) LIMIT 1
UPDATE `users` SET `updated_at` = '2020-07-29 11:15:26', `last_login_at` = '2020-07-29 11:15:26' WHERE `id` = 2
---
  def create
    @user = User.first(:conditions => [ "email like ?", params[:user][:email]])
    if @user && @user.authenticate(params[:user][:password])
      if @user.email_confirmed
        session[:user_id] = @user.id
        if @user.last_login_at.nil?
          flash[:alert] = 'Welcome. Please consider completing your profile'
          @user.update_attributes(:last_login_at => Time.now)