app/controllers/users_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (id like 3) LIMIT 1

  def create
    @user = User.new(
                     :user_name => params[:user][:user_name],
                     :email => params[:user][:email],
                     :password => params[:user][:password],
                     :password_confirmation => params[:user][:password_confirmation]
                    )
    if @user.save
---
INSERT INTO `users` (`reset_password_token`, `avatar`, `password_digest`, `updated_at`, `email`, `user_name`, `last_name`, `full_name`, `confirm_token`, `last_login_at`, `created_at`, `first_name`, `email_confirmed`, `reset_password_sent_at`) VALUES(NULL, NULL, '$2a$10$d35uiRq2XKrQjKT5Il3oXuHlguaoDSdLpNvWmCYIApY3yFMnH1mb.', '2020-07-29 05:44:35', 'ahammednafihbk@gmail.com', 'anbk', NULL, '', 'b9Jm0SczHbNoPgH+ljeVng==', NULL, '2020-07-29 05:44:35', NULL, 0, NULL)

  def update
     @user = User.find(params[:id])
     @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `updated_at` = '2020-07-29 11:45:56', `password_digest` = '$2a$10$Itt8jxL6R5I/PLUqsX/izuQKvwTSEj1i41FyNt.x5VCPpeN0tB5nO', `first_name` = 'Ahammed', `last_name` = 'Nafih', `avatar` = 'nafi_profile.jpg', `full_name` = 'Ahammed Nafih' WHERE `id` = 3

  def confirm_email
    user = User.first(:conditions => [ "confirm_token like ?", params[:id]])
---
SELECT * FROM `users` WHERE (confirm_token like 'rljxt75Jb2bjOq8GbDi6JQ==') LIMIT 1