app/controllers/user_controller.rb

  def create
    @user = User.new(:name => params[:user][:name], :email => params[:user][:email],
                     :password => params[:user][:password])
    if @user.save
---
INSERT INTO `users` (`user_name`, `email`, `email_confirmed`, `created_at`, `confirm_token`, `reset_password_token`, `reset_password_sent_at`, `password_digest`, `updated_at`) VALUES('anbk', 'ahammednafihbk@gmail.com', 0, '2020-07-27 19:30:38', '5MyvMV4wtudKL8rQk6uU+g==', NULL, NULL, '$2a$10$tTm2ztUhzp0SoZDIz9uPEeJ3sxBlWIX6gvzoZsS2xJV2LCd7LVc4q', '2020-07-27 19:30:38')

  def confirm_email
    user = User.first(:conditions => [ "confirm_token like ?", params[:id]])
---
SELECT * FROM `users` WHERE (confirm_token like 'y1JUA1oHZWkilAJQgKyBcQ==') LIMIT 1